'''
중복 순열
서로 다른 n개의 원소 중에서 중복을 허용하면서 r개를 순서있게 뽑는 방법의 수
즉, 한 원소를 여러번 뽑을 수 있고, 뽑은 순서를 고려함

print(n**r)

=====================================================================

중복 조합
서로 다른 n개의 원소 중에서 중복을 허용하면서 r개를 순서 없이 뽑는 방법의 수
즉, 한 원소를 여러번 뽑을 수 있지만, 순서는 고려하지 않음

math.comb(n+r-1, r)

=====================================================================

중복 원소가 있는 순열
동일한 원소가 여러 번 있는 집합(예: AAB)에서 원소들을 모두 사용하여 순열을 만드는 방법의 수
전체 원소의 개수가 n이고, 중복된 원소의 개수가 n1,n2,...,nk일 때

math.factorial(n) / (math.factorial(n1) * math.factorial(n2) * ...)

=====================================================================

완전 순열
순열의 일종으로, 일렬로 배열한 대상들의 위치를 재조정했을 때,
모든 대상이 자기 위치에 있지 않도록 하는 배열 방법

D[n] = (n-1)(D[n-1]+D[n-2])

D[0] = 1
D[1] = 0
D[2] = 1
D[3] = 2
D[4] = 9
D[5] = 44
'''